Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: Exercise caution.
ja: ご用心を。

source: Existing files will be cleared!
ja: 既存ファイルは消去されます！

source: Exit code, iff WIFEXITED(s) Source Edit
ja: WIFEXITED の場合に限り、終了コードとなります ソース 編集

source: Export statement
ja: Export ステートメント

source: Exportc pragma
ja: Exportc プラグマ

source: Exports
ja: エクスポート

source: Exposes the list of requirements for read and write accesses.
ja: 読み書きアクセスで必要となる公開リストです。

source: Extensions are returned without the leading dot.
ja: 頭文字のドットを取り除いたものを拡張子として返します。

source: Extern pragma
ja: Extern プラグマ

source: Extracts the red/green/blue components of the color a.
ja: カラー a の赤 (R)・緑 (G)・青 (B) コンポートを抽出します。

source: Fast sumation functions.
ja: 高速処理による総和関数です。

source: Fast version of a push followed by a pop.
ja: push の高速版です。続けて pop を行います。

source: File access permission, modelled after UNIX.
ja: UNIX を手本にしたファイルアクセス権限。

source: File must be ASCII text.
ja: ファイルは ASCII 形式のテキストになります。

source: File number of stderr; Source Edit
ja: 標準エラー出力 (stderr) のファイル番号。 ソース 編集

source: File number of stdin; Source Edit
ja: 標準入力 (stdin) のファイル番号。 ソース 編集

source: File number of stdout; Source Edit
ja: 標準出力 (stdout) のファイル番号。 ソース 編集

source: File was accessed.
ja: ファイルがアクセスされた。

source: File was ignored.
ja: ファイルが無視された。

source: File was modified.
ja: ファイルが修正された。

source: File was moved from X. Source Edit
ja: X からファイルが移動された。 ソース 編集

source: File was moved to Y. Source Edit
ja: ファイルが Y へ移動された。 ソース 編集

source: File was opened.
ja: ファイルが開かれた。

source: FileInfo object
ja: FileInfo オブジェクト

source: FilePermission enum
ja: FilePermission 列挙型

source: FileStream example
ja: FileStream の用例

source: Filename globbing.
ja: ファイル名のグロブ処理。

source: Filter-specific flag Source Edit
ja: Filter-specific flag ソース 編集

source: Find the difference in 2 arrays of integers.
ja: 整数配列同士の差異を検出します。

source: Find the difference in 2 text documents, comparing by textlines.
ja: テキスト行の比較により、テキストドキュメント同士を検出します。

source: Finds the first attribute of n with a name of name.
ja: name の名前で n にある最初の属性を検索します。

source: Finds the first child element of n with a name of name.
ja: name の名前で n にある最初の子要素を検索します。

source: Finds the sequence of ASCII characters that is the closest approximation to the UTF-8 string s.
ja: UTF-8 文字列 s に最も近い近似 ASCII 文字のシーケンスを検索します。

source: Finishes the MD5Context and stores the result in digest.
ja: MD5Context の生成後の結果を digest へ格納します。

source: Flags to pass to Inno Setup.
ja: Inno Setup へ渡されるフラグ。

source: Flags to pass to the C Compiler.
ja: C コンパイラへ渡されるフラグ。

source: Floats
ja: 浮動小数

source: Flushes f's buffer.
ja: バッファ f をフラッシュします。

source: For Postgre this adds RETURNING id to the query, so it only works if your primary key is named id.
ja: Postgre において、これはクエリへ RETURNING id を追加します。つまり、プライマリ・キーは名前付き id として動作します。

source: For Postgres it is safe though.
ja: なお、 Postgres では安全対策が講じられています。

source: For SSL support this module relies on OpenSSL.
ja: このモジュールの SSL サポートは OpenSSL によるものです。

source: For a release version use:
ja: リリースバージョンでは、

source: For backward compatibility Source Edit
ja: For backward compatibility ソース 編集

source: For backwards compatibility Source Edit
ja: For backwards compatibility ソース 編集

source: For convenience the required Distribution. qualifier is added to the enum value.
ja: 便宜上、 Distribution 型が必要になります。修飾子は列挙型の値に追加されます。

source: For example, a request of memalign(0x1000, 0x1001) == 0x2000 bytes allocated.
ja: 例えば、 memalign(0x1000, 0x1001) を要求すると 0x2000 バイトを割り当てます。

source: For example, the closest to string "Äußerst" in ASCII is "Ausserst".
ja: 例えば、文字列 "Äußerst" に最も近い ASCII は "Ausserst" です。

source: For example:
ja: 用例:

source: For high-level wrappers specialized for Linux and BSDs see: posix_utils
ja: Linux と BSD 専用の高水準ラッパーは posix_utils を参照してください。

source: For more information read http://www.unix.com/man-page/posix/3/utimes/.
ja: 詳細情報は http://www.unix.com/man-page/posix/3/utimes/ をお読みください。

source: For more procedures dealing with typedesc, see typetraits module.
ja: これ以外の typedesc を処理するプロシージャに関しては、 typetraits モジュールを参照してください。

source: For statement
ja: For ステートメント

source: For unlimited queue set maxItems to 0.
ja: キューを無制限にするには maxItems へ 0 を設定します。

source: Force EV_ERROR on success, data == 0 Source Edit
ja: Force EV_ERROR on success, data == 0 ソース 編集

source: Foreign function interface
ja: 外部関数インタフェース

source: Forward declarations
ja: 前方宣言

source: Forward definitions work properly, you just need to always add the {.async.} pragma:
ja: 前方定義を正しく動作させるには、必ず {.async.} プラグマを書き加えてください。

source: Found nodes satisfying the condition will be appended to the result sequence.
ja: 見つかったノードが条件を満たしていれば result のシーケンスの末尾に追加します。

source: Frees the resources associated with the lock.
ja: ロックに関連づけられたリソースを開放します。

source: From statement
ja: From ステートメント

source: Func
ja: 関数

source: Funcs
ja: 関数

source: Future directions
ja: 将来的方向

source: GUI libraries
ja: GUI ライブラリ

source: Generate HTML documentation for a file:
ja: ファイルから HTML ドキュメンテーションを生成するには:

source: Generate HTML documentation for a whole project:
ja: プロジェクト全体から HTML ドキュメンテーションを生成するには:

source: Generate MD5 hash for a file.
ja: ファイルの MD5 ハッシュを生成します。

source: Generate MD5 hash for a string.
ja: 文字列の MD5 ハッシュを生成します。

source: Generate hash of Oid for use in hashtables Source Edit
ja: ハッシュテーブルを用いてオブジェクト ID のハッシュを生成します。 ソース 編集

source: Generated: 2020-04-03 12:32:27 UTC
ja: 生成日時: 2020年04月03日 午前12時32分27秒 (UTC)

source: Generated: 2020-04-03 12:34:31 UTC
ja: 生成日時: 2020年04月03日 午前12時34分31秒 (UTC)

source: Generated: 2020-04-03 12:34:49 UTC
ja: 生成日時: 2020年04月03日 午前12時34分49秒 (UTC)

source: Generated: 2020-04-03 12:34:52 UTC
ja: 生成日時: 2020年04月03日 午前12時34分52秒 (UTC)

source: Generated: 2020-04-03 12:35:14 UTC
ja: 生成日時: 2020年04月03日 午前12時35分14秒 (UTC)

source: Generated: 2020-04-03 12:35:23 UTC
ja: 生成日時: 2020年04月03日 午前12時35分23秒 (UTC)

source: Generated: 2020-04-03 12:35:25 UTC
ja: 生成日時: 2020年04月03日 午前12時35分25秒 (UTC)

source: Generated: 2020-04-03 12:35:26 UTC
ja: 生成日時: 2020年04月03日 午前12時35分26秒 (UTC)

source: Generated: 2020-04-03 12:35:27 UTC
ja: 生成日時: 2020年04月03日 午前12時35分27秒 (UTC)

source: Generated: 2020-04-03 12:35:28 UTC
ja: 生成日時: 2020年04月03日 午前12時35分28秒 (UTC)

source: Generated: 2020-04-03 12:35:29 UTC
ja: 生成日時: 2020年04月03日 午前12時35分29秒 (UTC)

source: Generated: 2020-04-03 12:35:30 UTC
ja: 生成日時: 2020年04月03日 午前12時35分30秒 (UTC)

source: Generated: 2020-04-03 12:35:31 UTC
ja: 生成日時: 2020年04月03日 午前12時35分31秒 (UTC)

source: Generated: 2020-04-03 12:35:32 UTC
ja: 生成日時: 2020年04月03日 午前12時35分32秒 (UTC)

source: Generated: 2020-04-03 12:35:33 UTC
ja: 生成日時: 2020年04月03日 午前12時35分33秒 (UTC)

source: Generated: 2020-04-03 12:35:34 UTC
ja: 生成日時: 2020年04月03日 午前12時35分34秒 (UTC)

source: Generated: 2020-04-03 12:35:35 UTC
ja: 生成日時: 2020年04月03日 午前12時35分35秒 (UTC)

source: Generated: 2020-04-03 12:35:36 UTC
ja: 生成日時: 2020年04月03日 午前12時35分36秒 (UTC)

source: Generated: 2020-04-03 12:35:37 UTC
ja: 生成日時: 2020年04月03日 午前12時35分37秒 (UTC)

source: Generated: 2020-04-03 12:35:38 UTC
ja: 生成日時: 2020年04月03日 午前12時35分38秒 (UTC)

source: Generated: 2020-04-03 12:35:39 UTC
ja: 生成日時: 2020年04月03日 午前12時35分39秒 (UTC)

source: Generated: 2020-04-03 12:35:41 UTC
ja: 生成日時: 2020年04月03日 午前12時35分41秒 (UTC)

source: Generated: 2020-04-03 12:35:42 UTC
ja: 生成日時: 2020年04月03日 午前12時35分42秒 (UTC)

source: Generated: 2020-04-03 12:35:43 UTC
ja: 生成日時: 2020年04月03日 午前12時35分43秒 (UTC)

source: Generated: 2020-04-03 12:35:45 UTC
ja: 生成日時: 2020年04月03日 午前12時35分45秒 (UTC)

source: Generated: 2020-04-03 12:35:46 UTC
ja: 生成日時: 2020年04月03日 午前12時35分46秒 (UTC)

source: Generated: 2020-04-03 12:35:47 UTC
ja: 生成日時: 2020年04月03日 午前12時35分47秒 (UTC)

source: Generated: 2020-04-03 12:35:48 UTC
ja: 生成日時: 2020年04月03日 午前12時35分48秒 (UTC)

source: Generated: 2020-04-03 12:35:49 UTC
ja: 生成日時: 2020年04月03日 午前12時35分49秒 (UTC)

source: Generated: 2020-04-03 12:35:50 UTC
ja: 生成日時: 2020年04月03日 午前12時35分50秒 (UTC)

source: Generated: 2020-04-03 12:35:51 UTC
ja: 生成日時: 2020年04月03日 午前12時35分51秒 (UTC)

source: Generated: 2020-04-03 12:35:52 UTC
ja: 生成日時: 2020年04月03日 午前12時35分52秒 (UTC)

source: Generated: 2020-04-03 12:35:54 UTC
ja: 生成日時: 2020年04月03日 午前12時35分54秒 (UTC)

source: Generated: 2020-04-03 12:35:56 UTC
ja: 生成日時: 2020年04月03日 午前12時35分56秒 (UTC)

source: Generated: 2020-04-03 12:35:57 UTC
ja: 生成日時: 2020年04月03日 午前12時35分57秒 (UTC)

source: Generated: 2020-04-03 12:35:58 UTC
ja: 生成日時: 2020年04月03日 午前12時35分58秒 (UTC)

source: Generated: 2020-04-03 12:35:59 UTC
ja: 生成日時: 2020年04月03日 午前12時35分59秒 (UTC)

source: Generated: 2020-04-03 12:36:01 UTC
ja: 生成日時: 2020年04月03日 午前12時36分01秒 (UTC)

source: Generated: 2020-04-03 12:36:02 UTC
ja: 生成日時: 2020年04月03日 午前12時36分02秒 (UTC)

source: Generated: 2020-04-03 12:36:03 UTC
ja: 生成日時: 2020年04月03日 午前12時36分03秒 (UTC)

source: Generated: 2020-04-03 12:36:04 UTC
ja: 生成日時: 2020年04月03日 午前12時36分04秒 (UTC)

source: Generated: 2020-04-03 12:36:05 UTC
ja: 生成日時: 2020年04月03日 午前12時36分05秒 (UTC)

source: Generated: 2020-04-03 12:36:06 UTC
ja: 生成日時: 2020年04月03日 午前12時36分06秒 (UTC)

source: Generated: 2020-04-03 12:36:07 UTC
ja: 生成日時: 2020年04月03日 午前12時36分07秒 (UTC)

source: Generated: 2020-04-03 12:36:08 UTC
ja: 生成日時: 2020年04月03日 午前12時36分08秒 (UTC)

source: Generated: 2020-04-03 12:36:11 UTC
ja: 生成日時: 2020年04月03日 午前12時36分11秒 (UTC)

source: Generated: 2020-04-03 12:36:12 UTC
ja: 生成日時: 2020年04月03日 午前12時36分12秒 (UTC)

source: Generated: 2020-04-03 12:36:13 UTC
ja: 生成日時: 2020年04月03日 午前12時36分13秒 (UTC)

source: Generated: 2020-04-03 12:36:14 UTC
ja: 生成日時: 2020年04月03日 午前12時36分14秒 (UTC)

source: Generated: 2020-04-03 12:36:15 UTC
ja: 生成日時: 2020年04月03日 午前12時36分15秒 (UTC)

source: Generated: 2020-04-03 12:36:17 UTC
ja: 生成日時: 2020年04月03日 午前12時36分17秒 (UTC)

source: Generated: 2020-04-03 12:36:19 UTC
ja: 生成日時: 2020年04月03日 午前12時36分19秒 (UTC)

source: Generated: 2020-04-03 12:36:20 UTC
ja: 生成日時: 2020年04月03日 午前12時36分20秒 (UTC)

source: Generated: 2020-04-03 12:36:21 UTC
ja: 生成日時: 2020年04月03日 午前12時36分21秒 (UTC)

source: Generated: 2020-04-03 12:36:22 UTC
ja: 生成日時: 2020年04月03日 午前12時36分22秒 (UTC)

source: Generated: 2020-04-03 12:36:25 UTC
ja: 生成日時: 2020年04月03日 午前12時36分25秒 (UTC)

source: Generated: 2020-04-03 12:36:26 UTC
ja: 生成日時: 2020年04月03日 午前12時36分26秒 (UTC)

source: Generated: 2020-04-03 12:36:27 UTC
ja: 生成日時: 2020年04月03日 午前12時36分27秒 (UTC)

source: Generated: 2020-04-03 12:36:28 UTC
ja: 生成日時: 2020年04月03日 午前12時36分28秒 (UTC)

source: Generated: 2020-04-03 12:36:30 UTC
ja: 生成日時: 2020年04月03日 午前12時36分30秒 (UTC)

source: Generated: 2020-04-03 12:36:32 UTC
ja: 生成日時: 2020年04月03日 午前12時36分32秒 (UTC)

source: Generated: 2020-04-03 12:36:33 UTC
ja: 生成日時: 2020年04月03日 午前12時36分33秒 (UTC)

source: Generated: 2020-04-03 12:36:34 UTC
ja: 生成日時: 2020年04月03日 午前12時36分34秒 (UTC)

source: Generated: 2020-04-03 12:36:35 UTC
ja: 生成日時: 2020年04月03日 午前12時36分35秒 (UTC)

source: Generated: 2020-04-03 12:36:36 UTC
ja: 生成日時: 2020年04月03日 午前12時36分36秒 (UTC)

source: Generated: 2020-04-03 12:36:37 UTC
ja: 生成日時: 2020年04月03日 午前12時36分37秒 (UTC)

source: Generated: 2020-04-03 12:36:38 UTC
ja: 生成日時: 2020年04月03日 午前12時36分38秒 (UTC)

source: Generated: 2020-04-03 12:36:39 UTC
ja: 生成日時: 2020年04月03日 午前12時36分39秒 (UTC)

source: Generated: 2020-04-03 12:36:40 UTC
ja: 生成日時: 2020年04月03日 午前12時36分40秒 (UTC)

source: Generated: 2020-04-03 12:36:41 UTC
ja: 生成日時: 2020年04月03日 午前12時36分41秒 (UTC)

source: Generated: 2020-04-03 12:36:42 UTC
ja: 生成日時: 2020年04月03日 午前12時36分42秒 (UTC)

source: Generated: 2020-04-03 12:36:43 UTC
ja: 生成日時: 2020年04月03日 午前12時36分43秒 (UTC)

source: Generated: 2020-04-03 12:36:44 UTC
ja: 生成日時: 2020年04月03日 午前12時36分44秒 (UTC)

source: Generated: 2020-04-03 12:36:45 UTC
ja: 生成日時: 2020年04月03日 午前12時36分45秒 (UTC)

source: Generated: 2020-04-03 12:36:46 UTC
ja: 生成日時: 2020年04月03日 午前12時36分46秒 (UTC)

source: Generated: 2020-04-03 12:36:47 UTC
ja: 生成日時: 2020年04月03日 午前12時36分47秒 (UTC)

source: Generated: 2020-04-03 12:36:48 UTC
ja: 生成日時: 2020年04月03日 午前12時36分48秒 (UTC)

source: Generated: 2020-04-03 12:36:49 UTC
ja: 生成日時: 2020年04月03日 午前12時36分49秒 (UTC)

source: Generated: 2020-04-03 12:36:50 UTC
ja: 生成日時: 2020年04月03日 午前12時36分50秒 (UTC)

source: Generated: 2020-04-03 12:36:52 UTC
ja: 生成日時: 2020年04月03日 午前12時36分52秒 (UTC)

source: Generated: 2020-04-03 12:36:53 UTC
ja: 生成日時: 2020年04月03日 午前12時36分53秒 (UTC)

source: Generated: 2020-04-03 12:36:55 UTC
ja: 生成日時: 2020年04月03日 午前12時36分55秒 (UTC)

source: Generated: 2020-04-03 12:36:57 UTC
ja: 生成日時: 2020年04月03日 午前12時36分57秒 (UTC)

source: Generated: 2020-04-03 12:36:58 UTC
ja: 生成日時: 2020年04月03日 午前12時36分58秒 (UTC)

source: Generated: 2020-04-03 12:37:00 UTC
ja: 生成日時: 2020年04月03日 午前12時37分00秒 (UTC)

source: Generated: 2020-04-03 12:37:01 UTC
ja: 生成日時: 2020年04月03日 午前12時37分01秒 (UTC)

source: Generated: 2020-04-03 12:37:02 UTC
ja: 生成日時: 2020年04月03日 午前12時37分02秒 (UTC)

source: Generated: 2020-04-03 12:37:03 UTC
ja: 生成日時: 2020年04月03日 午前12時37分03秒 (UTC)

source: Generated: 2020-04-03 12:37:04 UTC
ja: 生成日時: 2020年04月03日 午前12時37分04秒 (UTC)

source: Generated: 2020-04-03 12:37:05 UTC
ja: 生成日時: 2020年04月03日 午前12時37分05秒 (UTC)

source: Generated: 2020-04-03 12:37:07 UTC
ja: 生成日時: 2020年04月03日 午前12時37分07秒 (UTC)

source: Generated: 2020-04-03 12:37:08 UTC
ja: 生成日時: 2020年04月03日 午前12時37分08秒 (UTC)

source: Generated: 2020-04-03 12:37:09 UTC
ja: 生成日時: 2020年04月03日 午前12時37分09秒 (UTC)

source: Generated: 2020-04-03 12:37:10 UTC
ja: 生成日時: 2020年04月03日 午前12時37分10秒 (UTC)

source: Generated: 2020-04-03 12:37:11 UTC
ja: 生成日時: 2020年04月03日 午前12時37分11秒 (UTC)

source: Generated: 2020-04-03 12:37:12 UTC
ja: 生成日時: 2020年04月03日 午前12時37分12秒 (UTC)

source: Generated: 2020-04-03 12:37:13 UTC
ja: 生成日時: 2020年04月03日 午前12時37分13秒 (UTC)

source: Generated: 2020-04-03 12:37:14 UTC
ja: 生成日時: 2020年04月03日 午前12時37分14秒 (UTC)

source: Generated: 2020-04-03 12:37:15 UTC
ja: 生成日時: 2020年04月03日 午前12時37分15秒 (UTC)

source: Generated: 2020-04-03 12:37:16 UTC
ja: 生成日時: 2020年04月03日 午前12時37分16秒 (UTC)

source: Generated: 2020-04-03 12:37:17 UTC
ja: 生成日時: 2020年04月03日 午前12時37分17秒 (UTC)

source: Generated: 2020-04-03 12:37:18 UTC
ja: 生成日時: 2020年04月03日 午前12時37分18秒 (UTC)

source: Generated: 2020-04-03 12:37:19 UTC
ja: 生成日時: 2020年04月03日 午前12時37分19秒 (UTC)

source: Generated: 2020-04-03 12:37:20 UTC
ja: 生成日時: 2020年04月03日 午前12時37分20秒 (UTC)

source: Generated: 2020-04-03 12:37:21 UTC
ja: 生成日時: 2020年04月03日 午前12時37分21秒 (UTC)

source: Generated: 2020-04-03 12:37:22 UTC
ja: 生成日時: 2020年04月03日 午前12時37分22秒 (UTC)

source: Generated: 2020-04-03 12:37:23 UTC
ja: 生成日時: 2020年04月03日 午前12時37分23秒 (UTC)

source: Generated: 2020-04-03 12:37:24 UTC
ja: 生成日時: 2020年04月03日 午前12時37分24秒 (UTC)

source: Generated: 2020-04-03 12:37:25 UTC
ja: 生成日時: 2020年04月03日 午前12時37分25秒 (UTC)

source: Generated: 2020-04-03 12:37:26 UTC
ja: 生成日時: 2020年04月03日 午前12時37分26秒 (UTC)

source: Generated: 2020-04-03 12:37:27 UTC
ja: 生成日時: 2020年04月03日 午前12時37分27秒 (UTC)

source: Generated: 2020-04-03 12:37:28 UTC
ja: 生成日時: 2020年04月03日 午前12時37分28秒 (UTC)

source: Generated: 2020-04-03 12:37:29 UTC
ja: 生成日時: 2020年04月03日 午前12時37分29秒 (UTC)

source: Generated: 2020-04-03 12:37:30 UTC
ja: 生成日時: 2020年04月03日 午前12時37分30秒 (UTC)

source: Generated: 2020-04-03 12:37:31 UTC
ja: 生成日時: 2020年04月03日 午前12時37分31秒 (UTC)

source: Generated: 2020-04-03 12:37:32 UTC
ja: 生成日時: 2020年04月03日 午前12時37分32秒 (UTC)

source: Generated: 2020-04-03 12:37:33 UTC
ja: 生成日時: 2020年04月03日 午前12時37分33秒 (UTC)

source: Generated: 2020-04-03 12:37:34 UTC
ja: 生成日時: 2020年04月03日 午前12時37分34秒 (UTC)

source: Generates a SecureHash from a str.
ja: str から SecureHash を生成します。

source: Generates a SecureHash from a file.
ja: ファイルから SecureHash を生成します。

source: Generates a volatile load of the value stored in the container src.
ja: コンテナ src に格納された値をロードする volatile を生成します。

source: Generates a volatile store into the container dest of the value val.
ja: コンテナ dest へ値 val を格納する volatile を生成します。

source: Generates the HTML annotation-xml element.
ja: HTML annotation-xml 要素の生成。

source: Generates the HTML annotation element.
ja: HTML annotation 要素の生成。

source: Generates the HTML center element.
ja: HTML center 要素の生成。

source: Generates the HTML details element.
ja: HTML details 要素の生成。

source: Generates the HTML dialog element.
ja: HTML dialog 要素の生成。

source: Generates the HTML maction element.
ja: HTML maction 要素の生成。

source: Generates the HTML marquee element.
ja: HTML marquee 要素の生成。

source: Generates the HTML math element.
ja: HTML math 要素の生成。

source: Generates the HTML menclose element.
ja: HTML menclose 要素の生成。

source: Generates the HTML merror element.
ja: HTML merror 要素の生成。

source: Generates the HTML mfenced element.
ja: HTML mfenced 要素の生成。

source: Generates the HTML mfrac element.
ja: HTML mfrac 要素の生成。

source: Generates the HTML mglyph element.
ja: HTML mglyph 要素の生成。

source: Generates the HTML mi element.
ja: HTML mi 要素の生成。

source: Generates the HTML mlabeledtr element.
ja: HTML mlabeledtr 要素の生成。

source: Generates the HTML mmultiscripts element.
ja: HTML mmultiscripts 要素の生成。

source: Generates the HTML mn element.
ja: HTML mn 要素の生成。

source: Generates the HTML mo element.
ja: HTML mo 要素の生成。

source: Generates the HTML mover element.
ja: HTML mover 要素の生成。

source: Generates the HTML mpadded element.
ja: HTML mpadded 要素の生成。

source: Generates the HTML mphantom element.
ja: HTML mphantom 要素の生成。

source: Generates the HTML mroot element.
ja: HTML mroot 要素の生成。

source: Generates the HTML mrow element.
ja: HTML mrow 要素の生成。

source: Generates the HTML ms element.
ja: HTML ms 要素の生成。

source: Generates the HTML mspace element.
ja: HTML mspace 要素の生成。

source: Generates the HTML msqrt element.
ja: HTML msqrt 要素の生成。

source: Generates the HTML mstyle element.
ja: HTML mstyle 要素の生成。

source: Generates the HTML msub element.
ja: HTML msub 要素の生成。

source: Generates the HTML msubsup element.
ja: HTML msubsup 要素の生成。

source: Generates the HTML msup element.
ja: HTML msup 要素の生成。

source: Generates the HTML mtable element.
ja: HTML mtable 要素の生成。

source: Generates the HTML mtd element.
ja: HTML mtd 要素の生成。

source: Generates the HTML mtext element.
ja: HTML mtext 要素の生成。

source: Generates the HTML munder element.
ja: HTML munder 要素の生成。

source: Generates the HTML munderover element.
ja: HTML munderover 要素の生成。

source: Generates the HTML picture element.
ja: HTML picture 要素の生成。

source: Generates the HTML semantics element.
ja: HTML semantics 要素の生成。

source: Generates the HTML slot element.
ja: HTML slot 要素の生成。

source: Generates the HTML summary element.
ja: HTML summary 要素の生成。

source: Generating Code
ja: コードの生成

source: Generation of HTML documents is done via the doc command.
ja: HTML ドキュメンドは doc コマンドで生成します。

source: Generators
ja: ジェネレータ

source: Generic $ operator for arrays that is lifted from the components.
ja: 配列のジェネリック演算子 $ であり、要素を取り除きます。

source: Generic $ operator for openarrays that is lifted from the components of x.
ja: 無蓋配列 (openarray) のジェネリック演算子 $ であり、 x の要素を取り除きます。

source: Generic $ operator for seqs that is lifted from the components of x.
ja: シーケンス (seqs) のジェネリック演算子 $ であり、 x の要素を取り除きます。

source: Generic $ operator for sets that is lifted from the components of x.
ja: 集合 (sets) のジェネリック演算子 $ であり、 x の要素を取り除きます。

source: Generic $ operator for slices that is lifted from the components of x.
ja: スライスのジェネリック演算子 $ であり、 x の要素を取り除きます。

source: Generic $ operator for tuples that is lifted from the components of x.
ja: タプルのジェネリック演算子 $ であり、 x の要素を取り除きまさう。

source: Generic Operating System Services
ja: 一般的なオペレーティング・システムのサービス

source: Generic constructor for SEXP data.
ja: SEXP データの汎用のコンストラクタです。

source: Generics
ja: ジェネリック

source: Get PSK identity.
ja: PSK 認証情報を取得します。

source: Gets n's tag as a HtmlTag.
ja: n のタグを HtmlTag として取得します。

source: Gets a cookie.
ja: クッキーを取得します。

source: Gets extension which corresponds to mimetype.
ja: mimetype と一致する拡張子を返します。

source: Gets mimetype which corresponds to ext.
ja: ext と一致する mimetype を返します。

source: Gets the ID of the currently running thread.
ja: 現在実行しているスレッドの ID を取得します。

source: Gets the Nim command that the compiler has been invoked with, for example "c", "js", "build", "help".
ja: "c", "js", "build", "help" などコンパイラから呼び出された Nim コマンドを取得します。

source: Gets the associated text with the node n.
ja: ノード n へ関連するテキストを取得します。

source: Gets the attributes belonging to n.
ja: n の所属元となる属性を取得します。

source: Gets the client data of n.
ja: n のクライアントデータを取得します。

source: Gets the inner text of n:
ja: n の内部テキストを取得します。

source: Gets the node at index in a List.
ja: index により List (リスト) にあるノードを取得します。

source: Gets the tag name of n.
ja: n のタグ名を取得します。

source: Global configuration files under /etc/nim
ja: /etc/nim ディレクトリにあるグローバルコンフィギュレーション・ファイル

source: Go garbage collector
ja: Go ガーベジ・コレクター

source: Grammar
ja: 文法

source: Group by:
ja: 分類:

source: HTML DOM Aria Attributes Source Edit
ja: HTML DOM Aria 属性 ソース 編集

source: HTML DOM Common Attributes Source Edit
ja: HTML DOM Common 属性 ソース 編集

source: HTML DOM Core Attributes Source Edit
ja: HTML DOM Core 属性 ソース 編集

source: HTML DOM Event Attributes Source Edit
ja: HTML DOM Event 属性 ソース 編集

source: HTML anchor generation
ja: HTML アンカー生成

source: Hashing
ja: ハッシュ

source: Have a look at its configuration file:
ja: コンフィギュレーション・ファイルの内容は、

source: Header pragma
ja: Header プラグマ

source: Header to use for complete XML output.
ja: XML の完成出力で使うヘッダです。

source: Heaps are arrays for which a[k] <= a[2*k+1] and a[k] <= a[2*k+2] for all k, counting elements from 0.
ja: ヒープは a[k] <= a[2*k+1] と k に関する a[k] <= a[2*k+2] の配列がすべてあり、要素は 0 から数えます。

source: Here's an example of how the syntax looks like:
ja: これはシンタックスの用例です:

source: Hidden tasks are supported via an empty description.
ja: 隠しタスクは description を空にすることでサポートしています。

source: Hides the cursor.
ja: カーソルを非表示状態にします。

source: Hints on the build process:
ja: ビルド方法のヒント:

source: How can you challenge a perfect, immortal machine?"
ja: 完璧なる神の機関へ挑む術でもあるというのかね？"

source: However a human reader will probably still be able to guess what original string was meant from the context.
ja: とはいえ人力をもってすれば、文脈より原文の文字列の意味を推測することはできるでしょう。

source: However, it is possible to manually allocate shared memory for channels using e.g. system.allocShared0 and pass these pointers through thread arguments:
ja: しかし、 system.allocShared0 などを用いて channels の共有メモリを手動で割り当てることでスレッドの引数としてポインタを渡すことは可能です。

source: However, there are also lots of procs that aid in debugging:
ja: また、デバッグ支援用のプロシージャもあります。

source: INTERNAL FILE FOR USE ONLY BY nre.nim.
ja: nre.nim 専用の内部処理ファイルです。

source: IPv4 mapped address.
ja: IPv4 射影アドレス。

source: IPv4-compatible address.
ja: IPv4 互換アドレス。

source: Identifiers & Keywords
ja: 識別子とキーワード

source: Identifies the conversion from one codeset to another.
ja: あるコードセットから別のコードセットへの変換を判別します。

source: If "Console", niminst generates a special batch file for Windows to open up the command line shell.
ja: "Console" ならば、 niminst は Windows がコマンドラインシェルを開くための特別なバッチファイルを生成します。

source: If 'action' returns true, the current item is removed from the list.
ja: 'action' で true が返されたときは、リストから現在のアイテムを削除します。

source: If dir is "", the current directory is used.
ja: dir が "" のときは、カレントディレクトリを使います。

source: If n is xnElement, runs recursively on each child node and concatenates the results.
ja: n が xnElement ならば、各子ノードを再帰処理して結果を連結します。

source: If n is xnText or xnEntity, returns its content.
ja: n が xnText または xnEntity ならば、その内容を返します。

source: If n is a SList, it returns the number of elements.
ja: n が SList ならば、要素数を返します。

source: If prefix == "" true is returned.
ja: prefix == "" ならば true が返されます。

source: If safe is true then it will encode using the URL-Safe and Filesystem-safe standard alphabet characters, which substitutes - instead of + and _ instead of /.
ja: safe が true ならば、エンコーディングで URL セーフ、およびファイルシステムセーフな標準英字文字を使います。つまり 、 + は - で、 / は _ で置換します。

source: If suffix == "" true is returned.
ja: suffix == "" ならば true が返されます。

source: If false is returned line contains no new data.
ja: false が返されたならば、データに新しい line はありません。

source: If env == nil (default) the environment is inherited of the parent process.
ja: If env == nil (デフォルト) ならば親プロセスから環境変数を継承します。
